gap> K := GF(2);; F := GF(2^4);; x:= X(K, "x");; f:= x^4 + x + 1;;
gap> m := NrNormalFFE(K,4);
8
gap> for ffe in Elements(F) do Display(IsNormalFFE(K,f,ffe)); od;
false
false
false
false
false
false
true
false
true
true
false
true
true
true
true
true
gap> for ffe in Elements(F) do Display(IsNormalFFE(F,ffe)); od;
false
false
false
false
false
false
true
false
true
true
false
true
true
true
true
true
gap> for ffe in Elements(F) do Display(IsNormalFFE(f,ffe)); od;
false
false
false
false
false
false
true
false
true
true
false
true
true
true
true
true
gap> for ffe in Elements(F) do Display(IsNormalFFEB(K,f,ffe)); od;
false
false
false
false
false
false
true
false
true
true
false
true
true
true
true
true
gap> for ffe in Elements(F) do Display(IsNormalFFEB(F,ffe)); od;
false
false
false
false
false
false
true
false
true
true
false
true
true
true
true
true
gap> for ffe in Elements(F) do Display(IsNormalFFEB(f,ffe)); od;
false
false
false
false
false
false
true
false
true
true
false
true
true
true
true
true
gap> m1 := NrNormalFFEIgnoreConjugates(K,4);
2
gap> m := NrNormalFFE(K,7);
49
gap> m1 := NrNormalFFEIgnoreConjugates(K,7);
7
gap> m := NrNormalFFE(K,7);
49
gap> m1 := NrNormalFFEIgnoreConjugates(K,7);
7
gap> m := NrIrreduciblePoly(K, 4);
3
gap> m := NrIrreducibleNotPrimitivePoly(K, 4);
1
gap> m := NrPrimitivePoly(K, 4);
2
gap> m := NrPrimitivePoly(K, 7);
18
gap> m := NrIrreducibleNotPrimitivePoly(K, 7);
0
gap> FindNormalFFEs(GF(2^4));
[ 3, 6, 7, 9, 11, 12, 13, 14 ]
gap> FindNormalFFEsB(GF(2^4));
[ 3, 6, 7, 9, 11, 12, 13, 14 ]
gap> FindNormalFFEsIgnoreConjugates(GF(2^4));
[ 3, 7 ]
gap> FindNormalFFEsBIgnoreConjugates(GF(2^4));
[ 3, 7 ]
gap> FindNormalFFEs(GF(2^7));
[ 13, 19, 21, 25, 26, 27, 31, 35, 37, 38, 41, 42, 43, 45, 50, 51, 52, 53, 54, 62, 63, 70, 73, 74, 76, 77, 79, 81, 82, 84, 85, 86, 89, 90, 95, 100, 102, 103, 104, 106, 108, 111, 115, 119, 121, 123, 124, 125, 126 ]
gap> FindNormalFFEsB(GF(2^7));
[ 13, 19, 21, 25, 26, 27, 31, 35, 37, 38, 41, 42, 43, 45, 50, 51, 52, 53, 54, 62, 63, 70, 73, 74, 76, 77, 79, 81, 82, 84, 85, 86, 89, 90, 95, 100, 102, 103, 104, 106, 108, 111, 115, 119, 121, 123, 124, 125, 126 ]
gap> FindNormalFFEsBIgnoreConjugates(GF(2^7));
[ 13, 19, 21, 27, 31, 43, 63 ]
gap> FindNormalFFEsBIgnoreConjugates(GF(2^16));
[ 11, 13, 25, 29, 33, 35, 37, 41, 43, 45, 47, 53, 57, 61, 63, 65, 67, 73, 75, 77, 79, 81, 85, 93, 95, 99, 101, 103, 105, 115, 119, 121, 125, 131,
  135, 145, 149, 153, 157, 159, 161, 173, 181, 185, 191, 193, 195, 199, 201, 203, 205, 209, 211, 213, 215, 217, 221, 223, 225, 233, 235, 239, 241, 245, 247, 249, 259, 261, 271, 273, 279, 283, 285, 289, 291, 295, 297, 303, 305, 309, 323, 331, 333, 341, 345, 349, 351,
  353, 357, 361, 365, 369, 373, 377, 379, 383, 401, 403, 407, 415, 423, 425, 427, 429, 431, 437, 439, 441, 443, 445, 451, 453, 455, 457, 459, 463, 465, 467, 469, 471, 473,
  477, 479, 481, 483, 487, 489, 493, 497, 501, 503, 511, 517, 519, 525, 527, 529, 531, 535, 537, 541, 551, 553, 559, 565, 575, 577, 583, 593, 599, 601, 607, 611, 619, 623, 631, 633, 635, 637, 643, 647, 649, 653, 659, 665, 677, 681, 693, 697, 699, 705, 707, 713, 715,
  723, 725, 743, 749, 753, 755, 757, 765, 775, 781, 789, 793, 795, 797, 809, 811, 813, 821, 827, 829, 831, 833, 845, 847, 851, 853, 855, 859, 863, 865, 867, 869, 871, 873,
  877, 879, 881, 885, 887, 893, 901, 903, 905, 907, 909, 913, 917, 919, 921, 925, 931, 933, 939, 941, 945, 947, 953, 955, 967, 973, 983, 985, 987, 989, 993, 1001, 1007, 1011, 1023, 1043, 1045, 1047, 1055, 1059, 1065, 1069, 1079, 1083, 1085, 1087, 1091, 1093, 1095,
  1111, 1113, 1115, 1117, 1119, 1125, 1127, 1133, 1135, 1139, 1141, 1143, 1145, 1147, 1161, 1165, 1169, 1171, 1173, 1177, 1179, 1183, 1189, 1193, 1197, 1199, 1201, 1207, 1211, 1215, 1221, 1225, 1229, 1231,
  1233, 1235, 1239, 1241, 1245, 1247, 1253, 1263, 1273, 1277, 1289, 1291, 1301, 1307, 1311, 1315, 1319, 1321, 1327, 1333, 1335, 1343, 1347, 1351, 1357, 1363, 1373, 1379, 1391, 1399, 1407, 1411, 1413, 1417, 1419, 1421, 1423, 1425, 1427, 1429, 1431, 1437, 1443, 1447,
  1455, 1457, 1459, 1461, 1469, 1471, 1477, 1483, 1487, 1499, 1505, 1509, 1511, 1513, 1519, 1521, 1525, 1531, 1549, 1553, 1563, 1565, 1567, 1569, 1571, 1575, 1577, 1587, 1591, 1593, 1595, 1599, 1603, 1605,
  1607, 1619, 1621, 1625, 1627, 1631, 1637, 1639, 1641, 1643, 1645, 1647, 1655, 1659, 1661, 1663, 1671, 1673, 1679, 1689, 1691, 1695, 1699, 1703, 1707, 1713, 1715, 1717, 1719, 1721, 1733, 1735, 1737, 1739, 1741, 1743, 1745, 1747, 1751, 1753, 1755, 1757, 1761, 1763,
  1771, 1775, 1777, 1785, 1789, 1791, 1801, 1803, 1805, 1809, 1815, 1819, 1823, 1825, 1827, 1831, 1837, 1841, 1843, 1847, 1851, 1853, 1859, 1863, 1867, 1871, 1873, 1875, 1877, 1879, 1883, 1885, 1887, 1895,
  1901, 1903, 1907, 1909, 1911, 1919, 1925, 1929, 1933, 1935, 1945, 1947, 1949, 1951, 1957, 1959, 1961, 1963, 1965, 1969, 1973, 1977, 1979, 1983, 1987, 1989, 1995, 2001, 2003, 2009, 2015, 2017, 2019, 2025, 2033, 2039, 2041, 2047, 2117, 2119, 2121, 2135, 2141, 2143,
  2151, 2153, 2157, 2161, 2165, 2171, 2181, 2183, 2191, 2193, 2201, 2203, 2205, 2217, 2221, 2231, 2239, 2245, 2247, 2257, 2259, 2261, 2265, 2267, 2275, 2277, 2281, 2287, 2289, 2293, 2299, 2303, 2315, 2317,
  2321, 2325, 2327, 2329, 2331, 2333, 2345, 2347, 2349, 2355, 2357, 2367, 2377, 2385, 2387, 2393, 2395, 2403, 2405, 2407, 2411, 2423, 2443, 2445, 2449, 2451, 2459, 2461, 2467, 2469, 2471, 2477, 2479, 2485, 2493, 2499, 2509, 2513, 2515, 2517, 2519, 2527, 2545, 2551,
  2553, 2555, 2559, 2581, 2589, 2591, 2595, 2599, 2601, 2605, 2611, 2615, 2617, 2619, 2621, 2623, 2629, 2633, 2637, 2645, 2649, 2655, 2663, 2667, 2669, 2673, 2675, 2677, 2683, 2685, 2687, 2699, 2701, 2705,
  2709, 2715, 2717, 2723, 2727, 2729, 2731, 2735, 2737, 2739, 2747, 2749, 2755, 2757, 2759, 2761, 2763, 2773, 2781, 2783, 2787, 2789, 2793, 2799, 2801, 2803, 2809, 2811, 2813, 2831, 2835, 2853, 2855, 2857, 2859, 2861, 2867, 2875, 2877, 2883, 2885, 2887, 2889, 2891,
  2895, 2897, 2901, 2903, 2907, 2911, 2915, 2919, 2931, 2933, 2951, 2953, 2955, 2957, 2961, 2963, 2965, 2967, 2971, 2975, 2979, 2985, 2987, 2997, 2999, 3003, 3007, 3015, 3017, 3021, 3023, 3025, 3027, 3029,
  3033, 3037, 3043, 3047, 3051, 3053, 3059, 3065, 3067, 3071, 3125, 3127, 3129, 3131, 3135, 3141, 3143, 3145, 3153, 3163, 3165, 3167, 3177, 3179, 3181, 3187, 3197, 3209, 3211, 3215, 3225, 3227, 3231, 3235, 3237, 3239, 3249, 3251, 3253, 3255, 3257, 3259, 3263, 3269,
  3273, 3277, 3279, 3283, 3291, 3295, 3301, 3303, 3307, 3313, 3315, 3321, 3345, 3349, 3363, 3365, 3369, 3373, 3375, 3381, 3383, 3385, 3391, 3397, 3399, 3401, 3407, 3413, 3415, 3417, 3427, 3429, 3431, 3437,
  3439, 3447, 3451, 3467, 3471, 3475, 3477, 3481, 3483, 3485, 3487, 3491, 3495, 3499, 3501, 3507, 3511, 3515, 3525, 3527, 3531, 3533, 3535, 3541, 3543, 3545, 3547, 3549, 3555, 3557, 3559, 3563, 3567, 3569, 3571, 3573, 3575, 3577, 3581, 3613, 3615, 3621, 3623, 3625,
  3627, 3629, 3637, 3639, 3643, 3645, 3647, 3653, 3655, 3663, 3665, 3669, 3671, 3673, 3675, 3677, 3679, 3689, 3691, 3695, 3699, 3703, 3705, 3709, 3721, 3727, 3729, 3733, 3735, 3737, 3743, 3747, 3749, 3755,
  3759, 3761, 3765, 3769, 3771, 3775, 3781, 3785, 3789, 3791, 3793, 3795, 3801, 3811, 3813, 3821, 3823, 3825, 3829, 3835, 3837, 3857, 3859, 3863, 3865, 3877, 3881, 3885, 3891, 3893, 3895, 3897, 3899, 3911, 3913, 3915, 3917, 3919, 3921, 3923, 3925, 3927, 3929, 3935,
  3939, 3941, 3953, 3955, 3957, 3961, 3963, 3967, 3977, 3983, 3985, 3991, 3993, 3995, 4003, 4005, 4017, 4029, 4037, 4039, 4043, 4045, 4049, 4051, 4067, 4077, 4079, 4081, 4083, 4089, 4093, 4095, 4371, 4377,
  4379, 4381, 4387, 4395, 4399, 4403, 4409, 4411, 4415, 4427, 4431, 4437, 4441, 4443, 4451, 4455, 4457, 4459, 4463, 4467, 4469, 4471, 4475, 4489, 4491, 4495, 4505, 4509, 4511, 4523, 4525, 4535, 4537, 4539, 4541, 4543, 4549, 4551, 4553, 4557, 4559, 4563, 4565, 4581,
  4583, 4587, 4589, 4591, 4595, 4597, 4599, 4607, 4647, 4649, 4659, 4663, 4671, 4677, 4683, 4685, 4687, 4693, 4695, 4701, 4703, 4709, 4715, 4733, 4747, 4755, 4759, 4761, 4771, 4773, 4777, 4779, 4787, 4789,
  4791, 4795, 4797, 4799, 4805, 4811, 4813, 4819, 4821, 4823, 4827, 4829, 4835, 4845, 4851, 4855, 4859, 4863, 4889, 4895, 4905, 4907, 4909, 4915, 4919, 4925, 4935, 4937, 4943, 4947, 4953, 4959, 4967, 4969, 4971, 4973, 4975, 4983, 5007, 5011, 5017, 5021, 5023, 5027,
  5029, 5033, 5039, 5043, 5051, 5053, 5061, 5063, 5065, 5077, 5081, 5095, 5097, 5099, 5107, 5113, 5117, 5119, 5203, 5209, 5215, 5219, 5221, 5225, 5229, 5231, 5241, 5245, 5259, 5261, 5269, 5273, 5279, 5285,
  5287, 5293, 5299, 5301, 5309, 5319, 5325, 5333, 5335, 5337, 5339, 5343, 5349, 5353, 5355, 5371, 5375, 5399, 5403, 5405, 5411, 5415, 5429, 5439, 5447, 5451, 5455, 5465, 5467, 5469, 5471, 5475, 5479, 5481, 5483, 5485, 5493, 5501, 5503, 5517, 5519, 5523, 5527, 5531,
  5535, 5541, 5543, 5545, 5559, 5561, 5567, 5577, 5579, 5583, 5597, 5603, 5605, 5607, 5615, 5619, 5623, 5627, 5629, 5679, 5683, 5685, 5693, 5695, 5703, 5705, 5707, 5711, 5723, 5725, 5727, 5743, 5747, 5757,
  5759, 5781, 5783, 5795, 5797, 5807, 5811, 5813, 5815, 5817, 5819, 5821, 5831, 5835, 5837, 5845, 5849, 5855, 5859, 5861, 5863, 5865, 5869, 5875, 5877, 5879, 5881, 5883, 5885, 5917, 5919, 5927, 5939, 5943, 5947, 5951, 5961, 5963, 5965, 5967, 5975, 5979, 5983, 5987,
  5989, 5991, 5993, 5995, 5997, 5999, 6003, 6011, 6029, 6035, 6037, 6045, 6051, 6053, 6069, 6071, 6075, 6087, 6095, 6099, 6103, 6105, 6107, 6109, 6119, 6123, 6127, 6141, 6359, 6361, 6365, 6367, 6373, 6381,
  6383, 6387, 6391, 6393, 6395, 6427, 6429, 6439, 6441, 6453, 6457, 6459, 6463, 6471, 6473, 6475, 6483, 6495, 6501, 6507, 6509, 6511, 6515, 6517, 6521, 6555, 6557, 6559, 6565, 6569, 6573, 6579, 6587, 6589, 6591, 6599, 6601, 6607, 6615, 6619, 6621, 6639, 6645, 6647,
  6649, 6651, 6653, 6709, 6715, 6717, 6719, 6727, 6731, 6739, 6741, 6745, 6747, 6749, 6751, 6761, 6765, 6767, 6771, 6775, 6777, 6779, 6799, 6803, 6807, 6809, 6823, 6825, 6829, 6831, 6835, 6837, 6841, 6843,
  6847, 6855, 6859, 6861, 6871, 6873, 6885, 6889, 6893, 6895, 6901, 6903, 6907, 6909, 6911, 6953, 6957, 6963, 6967, 6971, 6983, 6985, 6989, 6991, 6997, 6999, 7001, 7003, 7005, 7007, 7013, 7017, 7023, 7027, 7033, 7039, 7055, 7065, 7077, 7085, 7091, 7093, 7099, 7101,
  7117, 7127, 7129, 7131, 7135, 7141, 7145, 7147, 7149, 7151, 7157, 7161, 7163, 7165, 7295, 7317, 7325, 7327, 7333, 7335, 7341, 7343, 7347, 7353, 7355, 7359, 7369, 7371, 7375, 7381, 7385, 7387, 7391, 7397,
  7405, 7407, 7411, 7415, 7419, 7461, 7463, 7465, 7481, 7497, 7499, 7501, 7503, 7507, 7509, 7511, 7513, 7515, 7517, 7519, 7525, 7527, 7543, 7545, 7547, 7567, 7595, 7597, 7599, 7609, 7613, 7615, 7629, 7641, 7647, 7655, 7657, 7661, 7663, 7667, 7671, 7673, 7677, 7679,
  7757, 7759, 7763, 7767, 7771, 7773, 7775, 7785, 7795, 7799, 7801, 7807, 7827, 7831, 7837, 7847, 7851, 7853, 7855, 7859, 7863, 7865, 7867, 7869, 7881, 7883, 7887, 7903, 7909, 7915, 7917, 7919, 7925, 7933,
  7935, 7973, 7975, 7977, 7983, 7991, 7993, 7995, 7999, 8021, 8025, 8027, 8029, 8031, 8037, 8039, 8045, 8055, 8063, 8083, 8085, 8091, 8093, 8101, 8103, 8105, 8121, 8137, 8143, 8147, 8149, 8153, 8157, 8159, 8167, 8169, 8173, 8179, 8181, 8185, 8189, 9363, 9365, 9367,
  9371, 9383, 9391, 9395, 9397, 9403, 9405, 9407, 9419, 9427, 9431, 9435, 9453, 9459, 9467, 9469, 9471, 9517, 9519, 9523, 9525, 9533, 9555, 9565, 9579, 9583, 9595, 9619, 9623, 9627, 9631, 9643, 9645, 9651,
  9653, 9655, 9659, 9661, 9677, 9683, 9687, 9691, 9693, 9695, 9701, 9707, 9717, 9719, 9723, 9725, 9727, 9811, 9819, 9821, 9829, 9843, 9847, 9851, 9855, 9883, 9887, 9893, 9899, 9907, 9909, 9919, 9931, 9935, 9941, 9943, 9951, 9957, 9959, 9963, 9965, 9967, 9973, 9975,
  9981, 10029, 10035, 10037, 10043, 10059, 10067, 10071, 10075, 10077, 10085, 10091, 10095, 10099, 10101, 10103, 10111, 10135, 10139, 10141, 10149, 10157, 10163, 10167, 10173, 10175, 10189, 10191, 10195, 10197, 10199, 10203, 10207, 10215,
  10219, 10227, 10231, 10235, 10237, 10239, 10571, 10573, 10575, 10579, 10587, 10599, 10611, 10613, 10615, 10623, 10645, 10647, 10651, 10653, 10667, 10677, 10679, 10685, 10701, 10703, 10709, 10715, 10717, 10719, 10733, 10739, 10741, 10747, 10749, 10751, 10839, 10845,
  10855, 10859, 10861, 10863, 10867, 10871, 10903, 10907, 10911, 10919, 10923, 10925, 10927, 10933, 10941, 10943, 10963, 10967, 10971, 10973, 10975, 10991, 10995, 10999, 11005, 11055, 11059, 11063, 11067, 11069, 11085, 11091, 11093, 11099,
  11101, 11103, 11111, 11117, 11119, 11123, 11127, 11133, 11159, 11163, 11165, 11167, 11175, 11181, 11189, 11191, 11199, 11213, 11215, 11219, 11239, 11245, 11247, 11253, 11263, 11443, 11447, 11451, 11453, 11469, 11479, 11485, 11487, 11501, 11503, 11507, 11511, 11515,
  11571, 11573, 11575, 11581, 11583, 11597, 11603, 11627, 11629, 11637, 11639, 11643, 11675, 11679, 11687, 11695, 11701, 11703, 11711, 11727, 11733, 11757, 11759, 11763, 11773, 11869, 11883, 11887, 11891, 11893, 11899, 11903, 11933, 11943,
  11947, 11949, 11963, 11965, 11981, 11983, 11991, 12011, 12013, 12021, 12029, 12085, 12093, 12109, 12111, 12115, 12117, 12119, 12123, 12125, 12139, 12141, 12149, 12151, 12155, 12157, 12187, 12191, 12199, 12205, 12207, 12215, 12221, 12237, 12243, 12245, 12247, 12251,
  12267, 12269, 12271, 12275, 12277, 13109, 13117, 13135, 13141, 13149, 13159, 13163, 13165, 13167, 13173, 13211, 13213, 13227, 13237, 13239, 13243, 13245, 13261, 13269, 13279, 13287, 13293, 13295, 13301, 13307, 13525, 13527, 13531, 13533,
  13535, 13549, 13551, 13563, 13567, 13627, 13631, 13655, 13659, 13661, 13677, 13687, 13693, 13695, 13723, 13749, 13751, 13775, 13781, 13789, 13803, 13807, 13813, 13819, 13933, 13981, 13999, 14007, 14011, 14031, 14047, 14055, 14061, 14069, 14077, 14159, 14165, 14167,
  14171, 14173, 14187, 14189, 14197, 14199, 14203, 14237, 14239, 14247, 14255, 14263, 14267, 14295, 14299, 14301, 14311, 14315, 14325, 14327, 14331, 14333, 14799, 14805, 14811, 14827, 14837, 14839, 14965, 14967, 14971, 14973, 15007, 15019,
  15023, 15031, 15035, 15037, 15055, 15063, 15083, 15085, 15093, 15099, 15165, 15183, 15189, 15191, 15199, 15211, 15213, 15221, 15223, 15231, 15287, 15291, 15295, 15317, 15319, 15323, 15327, 15339, 15349, 15351, 15357, 15607, 15611, 15615, 15701, 15703, 15707, 15725,
  15739, 15741, 15743, 15775, 15787, 15805, 15829, 15831, 15851, 15853, 15861, 15863, 15869, 15999, 16045, 16047, 16053, 16055, 16059, 16061, 16063, 16087, 16091, 16095, 16109, 16111, 16117, 16119, 16123, 16125, 16215, 16219, 16221, 16223,
  16245, 16253, 16255, 16299, 16301, 16303, 16311, 16317, 16319, 16349, 16351, 16379, 16383, 21847, 21851, 21855, 21867, 21887, 21931, 21935, 21947, 21951, 21975, 21995, 21999, 22015, 22191, 22199, 22207, 22251, 22271, 22367, 22383, 22447, 22455, 22491, 22495, 22519,
  22523, 23259, 23295, 23391, 23407, 23423, 23479, 23515, 23547, 23927, 23935, 23983, 23991, 23999, 24047, 24283, 24303, 24431, 24439, 24503, 24507, 24539, 24543, 24567, 28095, 28151, 28383, 28407, 28639, 28671, 30591, 30655, 32255 ]
gap> Length(last);
2048
gap> FindNormalFFEs(GF(2^6))= FindNormalFFEsNC(GF(2^6));
true
gap> FindNormalFFEs(GF(2^6))= FindNormalFFEsB(GF(2^6));
true
gap> FindNormalFFEsBNC(GF(2^6))= FindNormalFFEsB(GF(2^6));
true
gap> FindNormalFFEsIgnoreConjugates(GF(2^6))= FindNormalFFEsBIgnoreConjugates(GF(2^6));
true
gap> FindNormalFFEsIgnoreConjugatesNC(GF(2^6))= FindNormalFFEsBIgnoreConjugates(GF(2^6));
true
gap> FindNormalFFEsBIgnoreConjugatesNC(GF(2^6))= FindNormalFFEsBIgnoreConjugates(GF(2^6));
true
gap> IsONBI(8,5); IsONBI(8,2);
false
true
gap> IsONBII(2,5); IsONBII(2,2);
true
true
gap> IsONBI(GF(2^4)); IsONBII(GF(2^4));
true
false
gap> IsONBI(GF(2^5)); IsONBII(GF(2^5));
false
true
gap> IsONBI(GF(2^7)); IsONBII(GF(2^7));
false
false
gap> IsONBI(GF(2^16)); IsONBII(GF(2^16));
false
false
gap> ComplexityOfT(GenerateNB(GF(2^4), GeneratorOfField(GF(2^4))^3));
7
